tutorials/combustion/fireFoam/les/oppositeBurningPanels/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    ground
    {
        type            wall;
        nFaces          192;
        startFace       424628;
    }
    sides
    {
        type            patch;
        nFaces          8216;
        startFace       424820;
    }
    top
    {
        type            patch;
        nFaces          384;
        startFace       433036;
    }
    region0_to_panelRegion_fRight_zone
    {
        type            mappedWall;
        nFaces          3408;
        startFace       433420;
        sampleMode      nearestPatchFace;
        sampleRegion    panelRegion;
        samplePatch     region0_to_panelRegion_fRight_zone;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
3408
(
(-2.77556e-17 0 5.55112e-17)
(-2.77556e-17 -6.93889e-18 0)
(-5.55112e-17 0 0)
(0 -1.38778e-17 0)
(2.77556e-17 -2.77556e-17 0)
(2.77556e-17 0 0)
(2.77556e-17 -2.77556e-17 0)
(0 0 0)
...
)
;
    }
    region0_to_panelRegion_fLeft_zone
    {
        type            mappedWall;
        nFaces          3408;
        startFace       436828;
        sampleMode      nearestPatchFace;
        sampleRegion    panelRegion;
        samplePatch     region0_to_panelRegion_fLeft_zone;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
3408
(
(-2.77556e-17 0 0)
(-2.77556e-17 0 0)
(2.77556e-17 6.93889e-18 1.38778e-17)
(0 0 -1.38778e-17)
(2.77556e-17 6.93889e-18 6.93889e-18)
(2.77556e-17 -6.93889e-18 2.77556e-17)
(0 0 0)
(2.77556e-17 -1.38778e-17 6.93889e-18)
...
)
;
    }
    burner
    {
        type            patch;
        nFaces          768;
        startFace       440236;
    }
)

// ************************************************************************* //
