tutorials/combustion/fireFoam/les/oppositeBurningPanels/constant/pyrolysisZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    pyrolysis
    {
        active          true;

        pyrolysisModel  reactingOneDim;

        regionName      panelRegion;

        reactingOneDimCoeffs
        {
            filmCoupled     false;

            radFluxName     Qr;

            minimumDelta    1e-8;

            reactionDeltaMin 1e-8;

            moveMesh        false;
        }

        infoOutput      true;
    }
)

// ************************************************************************* //
